# Case Study on SQL

In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\amala\appdata\local\programs\python\python312\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\amala\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\amala\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\amala\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\amala\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\amala\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import sqlite3
import pandas as pd

In [3]:
def load_imdb_database(db_path):
  try:
    conn = sqlite3.connect(db_path)
    print("IMDB database loaded successfully.")
    return conn
  except sqlite3.Error as e:
    print(f"Error loading IMDB database: {e}")
    return None

In [4]:
db_path = "imdb (3).db"
conn = load_imdb_database(db_path)

if conn:
  print("Connection successful")
  cursor = conn.cursor()

IMDB database loaded successfully.
Connection successful

## Following is the schema of the IMDB database. It lists all tables and their schemas.

In [5]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()

print("Database Schema:")
for table in tables:
    table_name = table[0]
    print(f"\nTable: {table_name}")

    cursor.execute(f"PRAGMA table_info({table_name});")
    schema = cursor.fetchall()

    print("Columns:")
    for column in schema:
        cid, name, dtype, notnull, dflt_value, pk = column
        print(f"  - {name} ({dtype}), NOT NULL: {bool(notnull)}, Default: {dflt_value}, Primary Key: {bool(pk)}")

Database Schema:

Table: Movie
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - title (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - year (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - rating (REAL), NOT NULL: False, Default: None, Primary Key: False
  - num_votes (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Genre
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - GID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Language
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - LAID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Country
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - CID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Location
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - LID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Location
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - LID (REAL), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Country
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - CID (REAL), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Language
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - LAID (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Genre
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - GID (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Person
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - PID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - Gender (TEXT), NOT NULL: False, Default: None, Primary Key: False

Table: M_Producer
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - PID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Director
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - PID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Cast
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - PID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: students
Columns:
  - student_id (INT), NOT NULL: False, Default: None, Primary Key: True
  - student_name (VARCHAR(20)), NOT NULL: False, Default: None, Primary Key: False

# Write SQL queries for the following questions

## 1. Write query to list first 5 rows of Person table

In [28]:
q1 = """SELECT * FROM person LIMIT 5;"""
result = pd.read_sql_query(q1,conn)
result

   index        PID                   Name  Gender
0      0  nm0000288         Christian Bale    Male
1      1  nm0000949         Cate Blanchett  Female
2      2  nm1212722   Benedict Cumberbatch    Male
3      3  nm0365140          Naomie Harris  Female
4      4  nm0785227            Andy Serkis    Male

In [29]:
def q1_grader(q1):
  result = pd.read_sql_query(q1, conn)
  return result.shape == (5, 4)
print(q1_grader(q1))

True

## 2. Write query to select title, year and rating from Movie table

In [30]:
q2 = """SELECT title,year,rating FROM movie ;"""
result = pd.read_sql_query(q2,conn)
result

              title  year  rating
0            Mowgli  2018     6.6
1     Ocean's Eight  2018     6.2
2       Tomb Raider  2018     6.4
3      The Avengers  2012     8.1
4           Tumbbad  2018     8.5
...             ...   ...     ...
3468    Allah-Rakha  1986     6.2
3469          Anari  1993     4.7
3470  Come December  2006     5.7
3471     Kala Jigar  1939     3.3
3472         Kanoon  1994     3.2

[3473 rows x 3 columns]

In [31]:
def q2_grader(q2):
  result = pd.read_sql_query(q2, conn)
  return result.shape == (3473, 3) and result['title'][0]=='Mowgli'
print(q2_grader(q2))

True

## 3. Write query to get title of first movie in movie table sorted by year in ascending order

In [32]:
q3 = """SELECT title FROM movie ORDER BY year LIMIT 1;"""
result = pd.read_sql_query(q3,conn)
result

      title
0  Alam Ara

In [33]:
def q3_grader(q3):
  result = pd.read_sql_query(q3, conn)
  return result['title']=='Alam Ara'
print(q3_grader(q3))

0    True
Name: title, dtype: bool

## 4. Write query to get the very first year in which Devdas movie was released

In [34]:
q4 = """SELECT title,year FROM movie WHERE title = 'Devdas' ORDER BY year LIMIT 1;"""
result = pd.read_sql_query(q4,conn)
result

    title  year
0  Devdas  1936

In [ ]:
def q4_grader(q4):
  result = pd.read_sql_query(q4, conn)
  return result['year']=='1936'
print(q4_grader(q4))

0    True
Name: year, dtype: bool

## 5. Write query to get the number of movies released in 2018

In [35]:
q5 = """SELECT count(*) as movie_at_2018 FROM movie WHERE year=2018;"""
result = pd.read_sql_query(q5,conn)
result

   movie_at_2018
0             93

In [36]:
def q5_grader(q5):
  result = pd.read_sql_query(q5, conn)
  return result.iloc[0, 0] == 93
print(q5_grader(q5))

True

## 6. Write query to get the title of the movie with most number of votes in 2012

In [45]:
q6 = """SELECT title, year, rating FROM movie WHERE year = 2012 ORDER BY rating desc LIMIT 1;"""
result = pd.read_sql_query(q6,conn)
result

    title  year  rating
0  Shahid  2012     8.3

In [48]:
qa = """SELECT title, year, rating FROM movie WHERE title = 'The Avengers';"""
result = pd.read_sql_query(qa,conn)
result

          title  year  rating
0  The Avengers  2012     8.1

In [49]:
def q6_grader(q6):
  result = pd.read_sql_query(q6, conn)
  return result["title"]=="The Avengers"
print(q6_grader(q6))

0    True
Name: title, dtype: bool

## 7. Write SQL query to find all the unique movie titles released in 2018

In [50]:
q7 = """SELECT DISTINCT title FROM movie WHERE year = 2018;"""
result = pd.read_sql_query(q7,conn)
result

                             title
0                           Mowgli
1                    Ocean's Eight
2                      Tomb Raider
3                          Tumbbad
4                        Kedarnath
..                             ...
88              Leera the Soulmate
89  Shaadi Teri Bajayenge Hum Band
90                       Aadamkhor
91           Vaibhav Sethia: Don't
92                Shohrat the Trap

[93 rows x 1 columns]

In [51]:
def q7_grader(q7):
  result = pd.read_sql_query(q7, conn)
  return result.shape==(93, 1)
print(q7_grader(q7))

True

## 8. Write SQL query to get total number of movies released between 2017 (inclusive) and 2018 (inclusive)

In [77]:
q8 = """SELECT count(*) FROM movie WHERE year BETWEEN 2017 and 2018;"""
result = pd.read_sql_query(q8,conn)
result

   count(*)
0       211

In [78]:
def q8_grader(q8):
  result = pd.read_sql_query(q8, conn)
  return result.iloc[0, 0] == 211
print(q8_grader(q8))

True

## 9. Write SQL query to find the year in which maximum number of movies released

In [85]:
q9 = """SELECT year FROM movie GROUP BY year ORDER BY count(*) DESC LIMIT 1;"""
result = pd.read_sql_query(q9, conn)
result

   year
0  2005

In [86]:
def q9_grader(q9):
  result = pd.read_sql_query(q9, conn)
  return result["year"][0]=="2005"
print(q9_grader(q9))

True

## 10. Write SQL query to find the title of the movie with rating>9.5 and number of votes > 90

In [90]:
q10 = """SELECT title FROM movie WHERE rating >9.5 AND num_votes > 90;"""
result = pd.read_sql_query(q10, conn)
result

                    title
0  Man on Mission Fauladi

In [91]:
def q10_grader(q10):
  result = pd.read_sql_query(q10, conn)
  return result["title"][0]=="Man on Mission Fauladi"
print(q10_grader(q10))

True

## 11. Write SQL query to find the number of movies which has the word 'Dilwale' in their title

In [10]:
q11 = """SELECT * FROM movie WHERE title LIKE 'DIlwale%' OR '_Dilwale%';"""
result =  pd.read_sql_query(q11, conn)
result

   index        MID                        title  year  rating  num_votes
0    145  tt0112870  Dilwale Dulhania Le Jayenge  1995     8.2      56133
1    155  tt4535650                      Dilwale  2015     5.2      28043
2   1463  tt0337611                      Dilwale  1994     5.6       2458
3   3249  tt3030720      Dilwale:The Brave Heart  2001     9.3         83

In [ ]:
def q11_grader(q11):
  result = pd.read_sql_query(q11, conn)
  return result.iloc[0, 0] == 4
print(q11_grader(q11))

True

## 12. Write nested SQL query to find the CID of country which produced most number of movies

In [ ]:
"""SELECT movie.;"""

In [11]:
q12 = """SELECT CID FROM M_country GROUP BY CID ORDER BY COUNT(*) DESC LIMIT 1;"""
result =  pd.read_sql_query(q12, conn)
result

   CID
0  2.0

In [12]:
def q12_grader(q12):
  result = pd.read_sql_query(q12, conn)
  return result.iloc[0]==2.0
print(q12_grader(q12))

CID    True
Name: 0, dtype: bool

## 13. Write nested SQL query to the country which produced most number of movies (use both Courty table and M_Country table)

In [24]:
"""SELECT name,CID
from contry c
inner join M_country m as n_movie
on CID = CID;"""

'SELECT name,CID\nfrom contry c\ninner join M_country m as n_movie\non CID = CID;'

In [29]:
q13 = """SELECT name FROM country WHERE CID = ( SELECT CID FROM M_country GROUP BY CID ORDER BY COUNT(*) DESC LIMIT 1);"""
result =  pd.read_sql_query(q13, conn)
result

    Name
0  India

In [30]:
def q13_grader(q13):
  result = pd.read_sql_query(q13, conn)
  return result.iloc[0, 0] == "India"
print(q13_grader(q13))

True

## 14. Write SQL query to get the year and number of movies per year having number of movies per year is greater than 100

In [43]:
q14 = """SELECT year, COUNT(title) FROM movie GROUP BY year HAVING COUNT(title)>100 ORDER BY COUNT(title);"""
result =  pd.read_sql_query(q14, conn)
result

    year  COUNT(title)
0   2003           101
1   2004           103
2   2008           103
3   2007           104
4   2012           108
5   2011           109
6   2015           109
7   2010           117
8   2014           118
9   2016           118
10  2017           118
11  2013           127
12  2005           128

In [44]:
def q14_grader(q14):
  result = pd.read_sql_query(q14, conn)
  return result.shape==(13,2)
print(q14_grader(q14))

True

## 15. Write SQL query to get the Name and Language ID (LAID) corresponding to Malayalam language

In [47]:
q15 = """SELECT name,LAID FROM Language WHERE name = 'Malayalam';"""
result =  pd.read_sql_query(q15, conn)
result

        Name  LAID
0  Malayalam    19

In [48]:
def q15_grader(q15):
  result = pd.read_sql_query(q15, conn)
  print(result)
  return result[["Name", "LAID"]].values.tolist() == [['Malayalam', 19]]
print(q15_grader(q15))

        Name  LAID
0  Malayalam    19
True

## 16. Write SQL query to do inner join with movie table and M_Language table with MID colums

In [77]:
q16 = """SELECT title,year FROM movie m
inner join M_Language l
on m.MID = l.MID;"""
result = pd.read_sql_query(q16, conn)
result

              title  year
0            Mowgli  2018
1     Ocean's Eight  2018
2       Tomb Raider  2018
3      The Avengers  2012
4           Tumbbad  2018
...             ...   ...
3468    Allah-Rakha  1986
3469          Anari  1993
3470  Come December  2006
3471     Kala Jigar  1939
3472         Kanoon  1994

[3473 rows x 2 columns]

In [75]:
def q16_grader(q16):
  result = pd.read_sql_query(q16, conn)
  return result
print(q16_grader(q16))

              title  year
0            Mowgli  2018
1     Ocean's Eight  2018
2       Tomb Raider  2018
3      The Avengers  2012
4           Tumbbad  2018
...             ...   ...
3468    Allah-Rakha  1986
3469          Anari  1993
3470  Come December  2006
3471     Kala Jigar  1939
3472         Kanoon  1994

[3473 rows x 2 columns]

## 17. Write SQL query to list title, year and rating of malayalam movies in the database by doing an inner join with movie table and M_Language table with MID column, also assuming language ID of malayalam movies as 19

In [78]:
q17 = """SELECT title,year,rating FROM movie m
inner join M_Language l
on m.MID = l.MID
WHERE LAID = 19;"""
result = pd.read_sql_query(q17, conn)
result

                            title    year  rating
0                  Dil Hai Betaab    1993     4.6
1                        Chemmeen    1965     7.8
2                           Aryan    1988     7.2
3                       Kala Pani    1996     8.4
4                  Aadupuliyattam    2016     4.2
5                       New Delhi    1987     7.7
6                             Who  I 2018     7.1
7                     Cover Story    2000     5.8
8                        Vaishali    1988     7.7
9                     Maanthrikam    1995     6.3
10                      Abhimanyu    1991     7.1
11               Inspector Balram    1991     6.9
12               Satyameva Jayate    2000     5.3
13           Veettilekkulla Vazhi    2011     6.8
14  Alavuddinum Athbutha Vilakkum    1979     6.8
15                      The Train    2011     4.5

In [79]:
def q17_grader(q17):
  result = pd.read_sql_query(q17, conn)   
  return result.shape==(16,3)
print(q17_grader(q17))

True

In [31]:
![ -f academic.db ] && rm academic.db

conn = sqlite3.connect("academic.db")
cursor = conn.cursor()

'[' is not recognized as an internal or external command,
operable program or batch file.

## 18. Write SQL query to Create a table named students with two columns id (integer type) and name (varchar type)

In [87]:
q18a = """CREATE TABLE students (
        id INT PRIMARY KEY,
        name VARCHAR(20)
        );"""

In [88]:
def q18_grader_a(q18):
  try:
    cursor.execute(q18)
    return True
  except:
    pass

def q18_grader_b(q19):
  result = pd.read_sql_query(q19, conn)
  return result.columns.tolist() == ['id', 'name']

q18b = """SELECT * FROM students;"""

print(q18_grader_a(q18a) and q18_grader_b(q18b))

None

## 19. Write SQL query to insert the values (1, 'Alice') into students table

In [48]:
q19_a = """INSERT INTO students ( student_id, student_name) VALUES (1,'Alice');"""

In [49]:
q19_b = """SELECT * FROM students;"""
result = pd.read_sql_query("SELECT * FROM students",conn)
result

   student_id student_name
0           1        Alice

In [50]:
def q19_grader_a(q19_a):
  try:
    cursor.execute(q19_a)
  except:
    pass
  return True

def q19_grader_b(q19_b):
  result = pd.read_sql_query(q19_b, conn)
  return result.values.tolist() == [[1, 'Alice']]

q19_b = "SELECT * FROM students"
print(q19_grader_a(q19_a) and q19_grader_b(q19_b))

True

## 20. Write SQL Query to add the following more information to students table

| ID | Name    |
|----|---------|
| 2  | Bob     |
| 3  | Charlie |

In [79]:
q20 = """INSERT INTO students ( student_id, student_name) VALUES (2,'Bob'),(3,'Charlie');"""
conn.execute(q20)

In [81]:
q20 = """ SELECT * FROM students;"""
result = pd.read_sql_query(q20,conn)
result

   student_id student_name
0           1        Alice
1           2          Bob
2           3      Charlie

In [82]:
def q20_grader(q20):
  try:
    cursor.execute(q20)
  except:
    pass
  return True

def q20_grader_b(q20_b):
  result = pd.read_sql_query(q20_b, conn)
  return result.values.tolist() == [[1, 'Alice'], [2, 'Bob'], [3, 'Charlie']]

print(q20_grader(q20) and q20_grader_b(q19_b))

True

In [ ]:
# conn.close()